#### ExternalFileReference Members

---

|  |
| --- |
| ExternalFileReference Class   Methods   Properties   See Also |

The  ExternalFileReference  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalFileReference |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAbsolutePath | Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLinkedFileStatus | Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file. |
| Public method | GetPath | Gets the path of the link, relative or absolute according to the link's settings |
| Public method | GetReferencingId | Gets the ElementId corresponding to the element which this ExternalFileReference is associated with. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidExternalFileReference | Checks an ExternalFileReference to see if it is properly created. |
| Public method | IsValidPathTypeForExternalFileReference | Checks whether a PathType enum value will be valid to use with this ExternalFileReference. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ExternalFileReferenceType | The type of external file which this object references. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PathType | The path type of the link (relative, absolute, or server). |

# See Also

ExternalFileReference Class

Autodesk.Revit.DB Namespace